import React, { useState } from 'react';
import players from  '../../assets/images/players.png'
import players2 from  '../../assets/images/players2.png'



const ReadMoreReadLess = () => {
  const [isExpanded, setIsExpanded] = useState(false);

  const handleToggle = () => {
    setIsExpanded(!isExpanded);
  };

  return (
    <>
      <span>
      <div className='section1RES res'>
        <img src={players} alt="" />
        <p>
          يمتلك المنتخب السوري لكرة القدم تاريخًا غنيًا وحافلًا يمتد لعدة
          عقود. تأسس الفريق عام 1936 ، ومثل سوريا في العديد من 
          المسابقات الدولية ، حيث أظهر موهبة البلاد وشغفها بالرياضة.
          على مر السنين ، حقق الفريق إنجازات مهمة ، بما في ذلك التأهل 
          إلى تصفيات كأس العالم FIFA في مناسبات متعددة. على الرغم من 
          مواجهة التحديات بسبب الاضطرابات السياسية والاجتماعية ، أظهر 
          المنتخب السوري صمودًا وتصميمًا ، ويسعى باستمرار لإحداث تأثير
          على مسرح كرة القدم العالمي.
        </p> 
      </div>
        {isExpanded ? (
          <span id="more" className='res'>
            <div className='section2RES' >
              <p>
                من خلال التركيز القوي على تنمية الشباب ودعم المشجعين 
                المتحمسين ، تمكن الفريق من إنتاج لاعبين ماهرين ذهبوا للعب مع
                أندية محلية ودولية بارزة. إن تاريخ المنتخب السوري لكرة القدم 
                هو شهادة على حب البلاد لكرة القدم ورغبتها في ترك بصمة
                دائمة في عالم كرة القدم الدولية.
              </p>
              <img src={players2} alt="" />
            </div>


            <div className='section3RES'>
              <p>
                أظهر المنتخب السوري على مدار تاريخه أسلوب لعب يمزج بين المهارات الفنية والفطنة التكتيكية وروح الفريق القوية. شهد الفريق نجاحات وتحديات
                على حد سواء ، مع إنجازات ملحوظة بما في ذلك الوصول إلى نهائيات كأس آسيا لكرة القدم عام 1984 وحصوله على لقب بطولة اتحاد غرب آسيا لكرة 
                القدم عام 2012. هذه الإنجازات لم تجلب السعادة للجماهير فحسب ،بل وضعت سوريا أيضًا. على الخريطة كدولة كرة قدم تنافسية.
                لا يتعلق تاريخ المنتخب السوري لكرة القدم بالانتصارات والهزائم فحسب ، بل يتعلق أيضًا بشغف وتفاني المشاركين. إنها شهادة على قوة كرة القدم 
                كقوة موحدة تجمع الناس معًا وتتجاوز الحدود الاجتماعية والثقافية والسياسية. بينما يتطلع الفريق إلى المستقبل ، فإنه يحمل آمال وأحلام الأمة ،
                ويهدف إلى تحقيق المزيد من النجاح وترك بصمته على الساحة الكروية العالمية.
              </p>
            </div>
          </span>
        ) : (
          <span id="dots"></span>
        )}
      </span>
      <button id="myBtn" onClick={handleToggle} >
        <i class="screen fa-solid fa-arrow-down"></i>
        {isExpanded ? ' عرض القليل': 'عرض المزيد'}
        
      </button>
    </>
  );
};

export default ReadMoreReadLess;