import './Achievement.css'

const Achievement = () => {
  return (
    <div className='acheiv'>
      <h1>الجوائز</h1>
      <div class="achievement">
          <h4>حقق المنتخب السوري لكرة القدم العديد من الجوائز والتقديرات البارزة عبر تاريخه. فيما يلي بعض الجوائز والإنجازات البارزة:</h4>
          <ol>
              <li>كأس آسيا: في عام 1984 ، وصل المنتخب السوري إلى نهائيات كأس آسيا ، حيث احتل المركز الثاني في البطولة. لقد كان إنجازًا كبيرًا وأظهر القدرة التنافسية للفريق على المستوى القاري.</li>
              <li>بطولة اتحاد غرب آسيا لكرة القدم: في عام 2012 ، فازت سوريا ببطولة اتحاد غرب آسيا لكرة القدم ، والمعروفة أيضًا باسم بطولة اتحاد غرب آسيا لكرة القدم. كانت لحظة فخر للفريق وشهادة على مهارتهم وتصميمهم..</li>
              <li> تصفيات كأس العالم FIFA: تأهل المنتخب السوري إلى تصفيات كأس العالم FIFA في مناسبات متعددة. في حين أنهم لم يتأهلوا بعد للبطولة نفسها ، فإن وجودهم في التصفيات يسلط الضوء على قدرتهم التنافسية وطموحهم على الساحة العالمية.</li>
              <li>  كأس العرب: حقق المنتخب السوري نجاحاً في بطولة كأس الأمم العربية ، وهي بطولة منتخبات عربية. لقد وصلوا إلى نهائيات المسابقة وحصلوا على المركز الثاني ، مما يدل على قدرتهم على التنافس مع دول عربية أخرى.</li>
          </ol>
      </div>
    </div>
  )
}

export default Achievement;